import React from "react";
import ReactDOM from "react-dom";
import App from "./components/app";

ReactDOM.render(<App/>, document.querySelector("#root"));

/* 
*Створити додаток список покупок 

* 1  Кнопка "додати ➕" Відкриває інпут

* 2 і кнопку "зберегти 📀" де ми вводимо нову позицію після натиску зберегти має створитись нова позиція і виглядати так: 

*Виводити список покупок з можливістю редагування.
*В кожній позиції покупки має бути Назва і знаки ✍️ ❌ ✅ 
✍️ - редагувати (Редагує)
❌ - видалити (Видаляє позицію)
✅  - куплено (Закреслює назву)

!Вирішення 
?1 кнопку +➕ по натиску відкривається інпут з кнопкою зберегти 

?2 водимо інфо в інпут натиснули зберегти знизу створюється таблиця з веденим текстом 

?3 в tабоиці є можливість редагувати✍️ - видаляти❌ - зберігати ✅ 

?✍️ - редагувати (Редагує)
?❌ - видалити (Видаляє позицію)
?✅  - куплено (Закреслює назву)
*/

